#coding:utf-8
import pytest
import requests

'''废钢价格表单列表'''
Url = "http://mysteelapi.steelphone.com/v4/market/fgTable.htm?&isPad="
def test_get_success():
	body = {'userId':'503879','machineCode':'90526B160362A7A4FECA22411080F8CF'}
	result = requests.post(Url,data = body).json()
	#print(result)
	list = ['安徽普碳废钢市场行情表单','安徽钢厂废钢采购价格行情表单','安阳普碳废钢市场行情表单','包头普碳废钢市场行情表单','重庆普碳废钢市场行情表单','长春普碳废钢市场行情表单',
	'东北钢厂废钢采购价格行情表单','福州普碳废钢市场行情表单','福建普碳废钢市场行情表单','福建钢厂废钢采购价格行情表单','国际废钢行情表单','广东普碳废钢市场行情表单','广东钢厂废钢采购价格行情表单',
	'广州普碳废钢市场行情表单','广西普碳废钢市场行情表单','贵州普碳废钢市场行情表单','贵州钢厂废钢采购价格行情表单','合肥普碳废钢市场行情表单','哈尔滨普碳废钢市场行情表单','杭州普碳废钢市场行情表单',
	'河北普碳废钢市场行情表单','河北钢厂废钢采购价格行情表单','河南普碳废钢市场行情表单','河南钢厂废钢采购价格行情表单','湖北普碳废钢市场行情表单','湖北钢厂废钢采购价格行情表单','湖南普碳废钢市场行情表单',
	'湖南钢厂废钢采购价格行情表单','湖州普碳废钢市场行情表单','邯郸普碳废钢市场行情表单','黑龙江普碳废钢市场行情表单','京津市场普碳废钢市场行情表单','吉林普碳废钢市场行情表单','嘉兴普碳废钢市场行情表单',
	'江苏普碳废钢市场行情表单','江苏钢厂废钢采购价格行情表单','江西普碳废钢市场行情表单','江西钢厂废钢采购价格行情表单','江阴普碳废钢市场行情表单','金华普碳废钢市场行情表单','兰州普碳废钢市场行情表单',
	'柳州普碳废钢市场行情表单','聊城普碳废钢市场行情表单','辽宁普碳废钢市场行情表单','连云港普碳废钢市场行情表单','内蒙古普碳废钢市场行情表单','内蒙古钢厂废钢采购价格行情表单','南京普碳废钢市场行情表单',
	'宁波普碳废钢市场行情表单','上海普碳废钢市场行情表单','四川普碳废钢市场行情表单','四川钢厂废钢采购价格行情表单','山东普碳废钢市场行情表单','山东钢厂废钢采购价格行情表单','山西普碳废钢市场行情表单',
	'山西钢厂废钢采购价格行情表单','沈阳普碳废钢市场行情表单','绍兴普碳废钢市场行情表单','陕西普碳废钢市场行情表单','台州普碳废钢市场行情表单','唐山普碳废钢市场行情表单','天津钢厂废钢采购价格行情表单',
	'太原普碳废钢市场行情表单','乌鲁木齐普碳废钢市场行情表单','武汉普碳废钢市场行情表单','温州普碳废钢市场行情表单','徐州普碳废钢市场行情表单','西宁普碳废钢市场行情表单','云南普碳废钢市场行情表单',
	'烟台普碳废钢市场行情表单','银川普碳废钢市场行情表单','张家港普碳废钢市场行情表单','浙江钢厂废钢采购价格行情表单']
	#print(len(result['datas']))
	for i in range(0,73):
		assert result['datas'][i]['tableName'] in list

if __name__ == '__main__':
	pytest.main(["-s", "feigang_pricelist_test.py"])